app/controllers/messages_controller.rb

SELECT * FROM `messages` WHERE (user_id=1 and recipient=1) ORDER BY created_at DESC LIMIT 1
SELECT * FROM `messages` WHERE (`messages`.`to` = 1) ORDER BY created_at DESC
---
  def index
    if params[:sent] == "true"
      @messages = Message.find_all_by_user_id(current_user.id, :order => 'created_at DESC')
    else
      @messages = Message.find_all_by_to(current_user.id, :order => 'created_at DESC')

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
---
  def show
    @message = Message.find(params[:id])

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
---
  def edit
    @message = Message.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`login` IS NULL) LIMIT 1
INSERT INTO `messages` (`updated_at`, `body`, `sender`, `recipient`, `subject`, `user_id`, `created_at`) VALUES('2009-11-03 01:08:06', ' THE MAIL MODEL\r\n\r\n MP defines mail to be text communicated between users (both human\r\n and processes) in less that (but ideally approaching) real time.\r\n The definition excludes so-called console-to-console\r\n communication, where users exchange information at the character\r\n or line level.\r\n\r\n Pieces of mail are characterized by such attributes as title,\r\n content, author, and recipient. A piece of mail may be a one- or\r\n two-line message sent from one individual to another, a draft of a\r\n document sent by one individual to a design group for review, a\r\n polished, formal document sent from one group to another, a\r\n message sent to a human user by a process (e.g., an RJE server\r\n process might notify a user by Network Mail when his job has\r\n completed), etc. All such forms of communication are mail and are\r\n supported by MP.\r\n\r\n Pieces of mail can be forwarded from one location to another\r\n\r\n Pieces of mail can be replied to.\r\n\r\n The identity of the author of a piece of mail can be verified,\r\n avoiding forgery and misrepresentation.\r\n', 1, NULL, 'Testing this out again', 1, '2009-11-03 01:08:06')
---
  def create
    @message = Message.new(params[:message])
    @message.from = current_user.id
    @message.to = User.find_by_login(params[:message][:to]) ? User.find_by_login(params[:message][:to]).id : params[:message][:to]
    @message.user_id = current_user.id
    respond_to do |format|
      if @message.save

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
DELETE FROM `messages` WHERE `id` = 1
---
  def destroy
    @message = Message.find(params[:id])
    @message.destroy