app/controllers/messages_controller.rb

  def index
    @messages = Message.from_uniq_user(current_user)

    respond_to do |format|
      if params[:message]
        @message = Message.find_by_id(params[:message])
---
SELECT * FROM `messages` WHERE (`messages`.`id` = '10') LIMIT 1